---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.ReferenceViewerUiTargetFilter
source: html/881d8b82-0178-da76-5f57-c93295ea7b68.htm
---
# Autodesk.Revit.DB.ParameterTypeId.ReferenceViewerUiTargetFilter Property

"Filter": This is used by the UI to filter the list of target views.

## Syntax (C#)
```csharp
public static ForgeTypeId ReferenceViewerUiTargetFilter { get; }
```